package jobcode;

public class Job0731_04 {

    /**
     * 用某种排序方法对关键字序列（25,84,21,47,15,27,68,35,20)进行排序，序列的
     * 变化情况采样如下：
     * 15 20 21 25 47 27 68 35 84
     * 15 20 21 25 47 27 68 35 84
     * 15 20 21 25 47 27 68 35 84
     * 15 20 21 25 35 27 47 68 84
     * 15 20 21 25 27 35 47 68 84
     * 15 20 21 25 27 35 47 68 84
     * 编程实现该排序算法。
     * 输入描述：
     * 2
     * 输入为两行，第一行为序列长度，第二行为序列内容，如：
     * 9
     * 25 84 21 47 15 27 68 35 20
     * 输入要求：
     * 1.序列的长度大于等于1
     * 2.序列内容要求为整数
     */

    public static void main(String[] args) {


    }
}
