package offercode;

public class contentList {

    /**
     * 00   单例设计模式                    设计模式
     * 01	二维数组中的查找		          数组查找
     * 02	替换空格		                  字符串
     * 03	从尾到头打印链表		          链表
     * 04	重建二叉树		              树
     * 05	用两个栈实现队列		          队列栈
     * 06	旋转数组的最小数字		          查找
     * 07	斐波那契数列		              递归/数组
     * 08	跳台阶		                  递归/数组
     * 09	变态跳台阶		              贪心/数组
     * 10	矩形覆盖		                  递归/数组
     * 11	二进制中1的个数		          数学
     * 12	数值的整数次方		          数学
     * 13	调整数组顺序使奇数位于偶数前面     数组
     * 14	链表中倒数第k个结
     * 64	滑动窗口的最大值		          数组
     * 65	矩阵中的路径		              dfs回溯/数组
     * 66	机器人的运动范围	              数组/数组
     * 67	剪绳子		                  数组贪心高级算法
     */

}
