package offercode;

public class contentList {

    /**
     * 序号	    题解	                     数据结构类型
     * 03	二维数组中的查找            	数组
     * 04	替换空格		                字符串
     * 05	从尾到头打印链表	        	链表
     * 06	重建二叉树		            树
     * 07	用两个栈实现队列	        	栈、队列
     * 08	旋转数组的最小数字	            数组
     * 09	斐波那契数列	                数组
     * 10	二进制中1的个数	            数组
     * 11	数值的整数次方	            数值
     * 14	调整数组顺序使奇数位于偶数前面	数组
     * 15	链表中倒数第k个结点	        链表
     * 16	反转链表	                    链表
     * 17	合并两个排序的链表           	链表
     * 18	树的子结构	                树
     * 19	二叉树的镜像	                树
     * 20	顺时针打印矩阵             	数组
     * 21	包含min函数的栈	            栈
     * 22	栈的压入、弹出序列	            栈
     * 23	从上往下打印二叉树	            树
     * 24	二叉搜索树的后序遍历序列	    树
     * 25	二叉树中和为某一值的路径    	树
     * 26	复杂链表的复制	            链表
     * 27	二叉搜索树与双向链表	        树、链表
     * 28	字符串的排列	                字符串
     * 29	数组中出现次数超过一半的数字	    数组
     * 30	最小的k个数	                数组
     * 31	连续子数组的最大和	            数组
     * 32	从1到n整数中1出现的次数	        数组
     * 33	把数组排成最小的数	            数组
     * 34	丑数	                        数值
     * 35	第一个只出现一次的字符	        字符串
     * 36	数组中的逆序对	            数组
     * 37	两个链表的第一个公共结点	    链表
     * 38	数字在排序数组中出现的次数   	数组
     * 39	二叉树的深度	                树
     * 40	数组中只出现一次的数字          数组
     * 41	和为S的两个数字                数值
     * 42	左旋转字符串                  字符串
     * 44	扑克牌的顺子	                数组
     * 45	圆圈中最后剩下的数字	        数组
     * 46	求1+2+…+n 233	            数值
     * 47	不用加减乘除做加法	            数值
     * 49	把字符串转换成整数	            字符串
     * 51	数组中重复的数字	            数组
     * 52	构建乘积数组	                数组
     * 53	正则表达式匹配	            字符串
     * 54	表示数值的字符串	            字符串
     * 55	字符流中第一个不重复的字符	    字符串
     * 56	链表中环的入口结点	            链表
     * 57	删除链表中重复的结点	        链表
     * 58	二叉树的下一个结点	            树
     * 59	对称的二叉树	                树
     * 60	按之字形顺序打印二叉树	        树
     * 61	把二叉树打印成多行	            树
     * 62	序列化二叉树	                树
     * 63	二叉搜索树的第k个结点	        树
     * 64	数据流中的中位数	            数值
     * 65	滑动窗口的最大值	            数组
     * 66	矩阵中的路径	                数组
     * 67	机器人的运动范围	            数组
     */
}
